const reactJS = [
  {
    id: "react_1",
    name: "مبانی HTML و HTML5",
    description:
      "HTML  زبان نشانه گذاری است که ساختار صفحه پیچ را تشکیل میدهد. HTML  معمولا بر دور محتوای پیچ با قرار دادن نشانک به محتوی پیچ معنا و ساختار میدهد. برای مثال نشانک ها میتوانند یک تکه نوشته را به عناصر متفاوتی همچون تیتر، پاراگراف،لینک و یا لیست تبدیل کنند.در این بخش به مهمترین عناصر و مفاهیم HTML میپردازیم.",
  },
  {
    id: "react_2",
    name: "مبانی CSS",
    description:
      "CSS به مرورگر میگوید که محتوای پیجی که با HTML نوشتید را چگونه نمایش دهد. با CSS میتوانید رنگ، فونت، اندازه و بسیاری از دیگر جنبه های یک ساختمان HTML را کنترل کنید. حال که ساختمان سایتتان را درست کرده اید وقت آن است که با CSS به تزیین آن بپردازیم.",
  },
  {
    id: "react_3",
    name: "قوانین طراحی سایت کنشگرا",
    description:
      ".طراحی سایت واکنشگرا درباره ساخت وب سایتی است که، در تمام موبایل ها،تبلت ها، لپ تاپ ها یا دسکتاپ ها به وضوع و مرتب و زیبا دیده شود در این بخش به کمک  CSS سایتتان را طوری طراحی خواهید کرد که در همه حال عالی باشد. مهم نیست که رو چه دستگاهی نمایش داده میشوند..",
  },
  {
    id: "react_4",
    name: "جاوا اسکریپت مقدماتی",
    description:
      "جاوا اسکریپت زبان برنامه‌نویسی پویا و مبتنی بر شی (Object-based) است که هم سمت کاربر و هم سمت سرور، برای ایجاد تعمال با صفحات وب به کار می‌رود .در این بخش به مبانی پایه زبان برنامه نویسی جاوااسکریپت میپردازیم.",
  },
  {
    id: "react_5",
    name: "جاوا اسکریپت در توسعه وب",
    description:
      "در این بخش به تعاملی کردن سایت بوسیله جاوااسکریپت و نحوه ی نوشتن عملکرد وب میپردازیم.",
  },
  {
    id: "react_6",
    name: "آموزش ری اکت",
    description:
      "ری اکت (reactjs) اساسا یک کتابخونه open-source جاوا اسکریپتی برای ساخت رابط کاربری(user interfaces) برای single page applications(اپلیکیشن های تک صفحه ای) است.این کتابخونه برای مدیریت لایه View برای وب استفاده می شود.در این قسمت به چگونگی ایجاد یک پروژه ری اکت و نوشتن یک سایت تک صفحه به صورت پروژه محور میپردازیم.",
  },
];
const mongoDB = [
  {
    id: "mongoDB_1",
    name: "1 مانگو دی بی",
    description:
      "مانگو دی‌بی (MongoDB) یک سیستم مدیریت پایگاه‌داده رایگان و اپن‌سورس است که از یک ساختار سندگرا استفاده می‌کند، این سیستم انواع مختلفی از داده را پشتیبانی می‌کند و یکی از انواع پایگاه داده‌ی غیر رابطه‌ای (non-relational) به حساب می‌آید ",
  },
  {
    id: "mongoDB_2",
    name: "2 مانگو دی بی",
    description:
      "مانگو دی‌بی (MongoDB) یک سیستم مدیریت پایگاه‌داده رایگان و اپن‌سورس است که از یک ساختار سندگرا استفاده می‌کند، این سیستم انواع مختلفی از داده را پشتیبانی می‌کند و یکی از انواع پایگاه داده‌ی غیر رابطه‌ای (non-relational) به حساب می‌آید ",
  },
  {
    id: "mongoDB_3",
    name: "3 مانگو دی بی",
    description:
      "مانگو دی‌بی (MongoDB) یک سیستم مدیریت پایگاه‌داده رایگان و اپن‌سورس است که از یک ساختار سندگرا استفاده می‌کند، این سیستم انواع مختلفی از داده را پشتیبانی می‌کند و یکی از انواع پایگاه داده‌ی غیر رابطه‌ای (non-relational) به حساب می‌آید ",
  },
  {
    id: "mongoDB_4",
    name: "4 مانگو دی بی",
    description:
      "مانگو دی‌بی (MongoDB) یک سیستم مدیریت پایگاه‌داده رایگان و اپن‌سورس است که از یک ساختار سندگرا استفاده می‌کند، این سیستم انواع مختلفی از داده را پشتیبانی می‌کند و یکی از انواع پایگاه داده‌ی غیر رابطه‌ای (non-relational) به حساب می‌آید ",
  },
  {
    id: "mongoDB_5",
    name: "5 مانگو دی بی",
    description:
      "مانگو دی‌بی (MongoDB) یک سیستم مدیریت پایگاه‌داده رایگان و اپن‌سورس است که از یک ساختار سندگرا استفاده می‌کند، این سیستم انواع مختلفی از داده را پشتیبانی می‌کند و یکی از انواع پایگاه داده‌ی غیر رابطه‌ای (non-relational) به حساب می‌آید ",
  },
  {
    id: "mongoDB_6",
    name: "6 مانگو دی بی",
    description:
      "مانگو دی‌بی (MongoDB) یک سیستم مدیریت پایگاه‌داده رایگان و اپن‌سورس است که از یک ساختار سندگرا استفاده می‌کند، این سیستم انواع مختلفی از داده را پشتیبانی می‌کند و یکی از انواع پایگاه داده‌ی غیر رابطه‌ای (non-relational) به حساب می‌آید ",
  },
];
const express = [
  {
    id: "express_1",
    name: "1 اکسپرس",
    description:
      "کار اکسپرس این است که یک ابزاری برای دستان برنامه نویسان وب بسازد که ساخت سایت با Node.js را راحت بکند در این قسمت با ساخت یکسرور بر مبنای اکپرس به صورت پروژه محور این بحث را یاد میگیریم.",
  },
  {
    id: "express_2",
    name: "2 اکسپرس",
    description:
      "کار اکسپرس این است که یک ابزاری برای دستان برنامه نویسان وب بسازد که ساخت سایت با Node.js را راحت بکند در این قسمت با ساخت یکسرور بر مبنای اکپرس به صورت پروژه محور این بحث را یاد میگیریم.",
  },
  {
    id: "express_3",
    name: "3 اکسپرس",
    description:
      "کار اکسپرس این است که یک ابزاری برای دستان برنامه نویسان وب بسازد که ساخت سایت با Node.js را راحت بکند در این قسمت با ساخت یکسرور بر مبنای اکپرس به صورت پروژه محور این بحث را یاد میگیریم.",
  },
  {
    id: "express_4",
    name: "4 اکسپرس",
    description:
      "کار اکسپرس این است که یک ابزاری برای دستان برنامه نویسان وب بسازد که ساخت سایت با Node.js را راحت بکند در این قسمت با ساخت یکسرور بر مبنای اکپرس به صورت پروژه محور این بحث را یاد میگیریم.",
  },
  {
    id: "express_5",
    name: "5 اکسپرس",
    description:
      "کار اکسپرس این است که یک ابزاری برای دستان برنامه نویسان وب بسازد که ساخت سایت با Node.js را راحت بکند در این قسمت با ساخت یکسرور بر مبنای اکپرس به صورت پروژه محور این بحث را یاد میگیریم.",
  },
  {
    id: "express_6",
    name: "6 اکسپرس",
    description:
      "کار اکسپرس این است که یک ابزاری برای دستان برنامه نویسان وب بسازد که ساخت سایت با Node.js را راحت بکند در این قسمت با ساخت یکسرور بر مبنای اکپرس به صورت پروژه محور این بحث را یاد میگیریم.",
  },
];
const nodeJS = [
  {
    id: "node_1",
    name: "1 نود جی اس",
    description:
      "node.js یک محیط برای اجرای جاوا اسکریپت (JavaScript) است. محیط اجرایی نود (node) شامل تمامی چیزهایی است که شما برای اجرای برنامه هایی که در جاوااسکریپت نوشته اید، به آن ها نیاز دارید.",
  },
  {
    id: "node_2",
    name: "2 نود جی اس",
    description:
      "node.js یک محیط برای اجرای جاوا اسکریپت (JavaScript) است. محیط اجرایی نود (node) شامل تمامی چیزهایی است که شما برای اجرای برنامه هایی که در جاوااسکریپت نوشته اید، به آن ها نیاز دارید.",
  },
  {
    id: "node_3",
    name: "3 نود جی اس",
    description:
      "node.js یک محیط برای اجرای جاوا اسکریپت (JavaScript) است. محیط اجرایی نود (node) شامل تمامی چیزهایی است که شما برای اجرای برنامه هایی که در جاوااسکریپت نوشته اید، به آن ها نیاز دارید.",
  },
  {
    id: "node_4",
    name: "4 نود جی اس",
    description:
      "node.js یک محیط برای اجرای جاوا اسکریپت (JavaScript) است. محیط اجرایی نود (node) شامل تمامی چیزهایی است که شما برای اجرای برنامه هایی که در جاوااسکریپت نوشته اید، به آن ها نیاز دارید.",
  },
  {
    id: "node_5",
    name: "5 نود جی اس",
    description:
      "node.js یک محیط برای اجرای جاوا اسکریپت (JavaScript) است. محیط اجرایی نود (node) شامل تمامی چیزهایی است که شما برای اجرای برنامه هایی که در جاوااسکریپت نوشته اید، به آن ها نیاز دارید.",
  },
  {
    id: "node_6",
    name: "6 اکسپرس",
    description:
      "node.js یک محیط برای اجرای جاوا اسکریپت (JavaScript) است. محیط اجرایی نود (node) شامل تمامی چیزهایی است که شما برای اجرای برنامه هایی که در جاوااسکریپت نوشته اید، به آن ها نیاز دارید.",
  },
];

const allCourses = [
  {
    mongoDB,
  },
  {
    express,
  },
  {
    reactJS,
  },
  {
      nodeJS,
  },
];
export default allCourses;
